// Задайте значения M и N. Напишите программу, которая выведет все четные натуральные числа 
// в промежутке от М до N с помощью рекурсии.
Console.Write ("Введите значение М-");
int m = Convert.ToInt32 (Console.ReadLine());
Console.Write ("Введите значение N-");
int n = Convert.ToInt32 (Console.ReadLine());
