// Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов
// в промежутке от M до N. C помощью рекурсии.

Console.Write (" Введите число М-");
int m = Conver.ToInt32 ( Console.ReadLine ());

Console.Write (" Введите число N-");
int n = Conver.ToInt32 ( Console.ReadLine ());

void Sum_M_N ( int m, int n );
{}